In [2]:
import numpy as np
import pandas as pd

from datetime import datetime

In [3]:
myyear = 2023
mymonth = 1
myday = 1
myhour = 2
mymin = 30
mysec = 15

In [4]:
mydate = datetime(myyear, mymonth, myday)

In [5]:
mydate

datetime.datetime(2023, 1, 1, 0, 0)

In [6]:
mydatetime = datetime(myyear, mymonth, myday, myhour, mymin, mysec)

In [11]:
mydatetime

datetime.datetime(2023, 1, 1, 2, 30, 15)

In [10]:
mydatetime.day

1

In [12]:
myser = pd.Series(["Nov 3, 1990", "2000-01-01", None])

In [13]:
myser

0    Nov 3, 1990
1     2000-01-01
2           None
dtype: object

In [14]:
myser[0]

'Nov 3, 1990'

In [18]:
timeser = pd.to_datetime(myser)

In [19]:
timeser[0]

Timestamp('1990-11-03 00:00:00')

In [20]:
obvi_euro_date = "31-12-2000"

In [21]:
pd.to_datetime(obvi_euro_date)

/var/folders/r_/klkmmq217614s08g7fjjkrj80000gn/T/ipykernel_51993/163700324.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  pd.to_datetime(obvi_euro_date)

Timestamp('2000-12-31 00:00:00')

In [22]:
euro_date = "10-12-2000"

In [25]:
pd.to_datetime(euro_date, dayfirst=True)

Timestamp('2000-12-10 00:00:00')

In [26]:
style_date = "22--Dec--2000"

In [28]:
pd.to_datetime(style_date, format="%d--%b--%Y")

Timestamp('2000-12-22 00:00:00')

In [29]:
custom_date = "12th of Dec 2000"

In [30]:
pd.to_datetime(custom_date)

Timestamp('2000-12-12 00:00:00')

In [31]:
sales = pd.read_csv("Resources/RetailSales_BeerWineLiquor.csv")

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [33]:
sales["DATE"]

0      1992-01-01
1      1992-02-01
2      1992-03-01
3      1992-04-01
4      1992-05-01
          ...
335    2019-12-01
336    2020-01-01
337    2020-02-01
338    2020-03-01
339    2020-04-01
Name: DATE, Length: 340, dtype: object

In [34]:
sales["DATE"] = pd.to_datetime(sales["DATE"])

In [35]:
sales["DATE"]

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [37]:
sales["DATE"][0].year

1992

In [38]:
sales = pd.read_csv("Resources/RetailSales_BeerWineLiquor.csv", parse_dates=[0])

In [39]:
sales["DATE"]

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [40]:
sales = sales.set_index("DATE")

In [45]:
sales.resample(rule="A").min()

            MRTSSM4453USN
DATE
1992-12-31           1509
1993-12-31           1529
1994-12-31           1505
1995-12-31           1501
1996-12-31           1652
1997-12-31           1621
1998-12-31           1768
1999-12-31           1808
2000-12-31           1920
2001-12-31           2052
2002-12-31           2109
2003-12-31           2046
2004-12-31           2219
2005-12-31           2219
2006-12-31           2424
2007-12-31           2569
2008-12-31           2675
2009-12-31           2781
2010-12-31           2878
2011-12-31           2888
2012-12-31           2995
2013-12-31           3155
2014-12-31           3310
2015-12-31           3482
2016-12-31           3607
2017-12-31           3740
2018-12-31           3991
2019-12-31           4116
2020-12-31           4388

In [52]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 340 entries, 1992-01-01 to 2020-04-01
Data columns (total 1 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   MRTSSM4453USN  340 non-null    int64
dtypes: int64(1)
memory usage: 5.3 KB

In [55]:
sales = pd.read_csv("Resources/RetailSales_BeerWineLiquor.csv", parse_dates=[0])

In [56]:
sales

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [57]:
sales["DATE"].dt.month

0       1
1       2
2       3
3       4
4       5
       ..
335    12
336     1
337     2
338     3
339     4
Name: DATE, Length: 340, dtype: int64